reports/kunlun_p800/benchmark/Qwen3.5-122B-A10B/test_01/01/2-320-i10240-o256/bench-test_01-2-320-i10240-o256.log
/opt/vllm_kunlun/lib/python3.10/site-packages/xpytorch_import_hook.py:6: UserWarning: pkg_resources is deprecated as an API. See https://setuptools.pypa.io/en/latest/pkg_resources.html. The pkg_resources package is slated for removal as early as 2025-11-30. Refrain from using this package or pin to Setuptools<81.
  import pkg_resources
XCCL /opt/vllm_kunlun/lib/python3.10/site-packages/torch_xmlir/libbkcl.so loaded
SYMBOL_REWRITE torch success
================================================================================
WARNING: Libraries loaded from different directories!
This may cause version mismatch issues.
--------------------------------------------------------------------------------
Directory: /lib/x86_64-linux-gnu
  - libcudart.so
  - libxpurt.so.2
Directory: /usr/local/xcudart/lib
  - libcuda.so.1
  - libcuda.so.1
  - libcupti.so.11
  - libxpuml.so.1
================================================================================
INFO 04-02 18:40:28 [__init__.py:43] Available plugins for group vllm.platform_plugins:
INFO 04-02 18:40:28 [__init__.py:45] - kunlun -> vllm_kunlun:register
INFO 04-02 18:40:28 [__init__.py:48] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
INFO 04-02 18:40:28 [__init__.py:217] Platform plugin kunlun is activated
WARNING 04-02 18:40:30 [interface.py:222] Failed to import from vllm._C: ImportError('libcudart.so.12: cannot open shared object file: No such file or directory')
ERROR 04-02 18:40:30 [config.py:33] Failed to import Triton kernels. Please make sure your triton version is compatible. Error: No module named 'triton.language.target_info'
ERROR 04-02 18:40:30 [gpt_oss_triton_kernels_moe.py:34] Failed to import Triton kernels. Please make sure your triton version is compatible. Error: No module named 'triton.language.target_info'
WARNING 04-02 18:40:32 [registry.py:814] Model architecture Qwen2VLForConditionalGeneration is already registered, and will be overwritten by the new model class vllm_kunlun.models.qwen2_vl:Qwen2VLForConditionalGeneration.
WARNING 04-02 18:40:32 [registry.py:814] Model architecture Qwen2_5_VLForConditionalGeneration is already registered, and will be overwritten by the new model class vllm_kunlun.models.qwen2_5_vl:Qwen2_5_VLForConditionalGeneration.
WARNING 04-02 18:40:32 [registry.py:814] Model architecture Qwen3NextForCausalLM is already registered, and will be overwritten by the new model class vllm_kunlun.models.qwen3_next:Qwen3NextForCausalLM.
WARNING 04-02 18:40:32 [registry.py:814] Model architecture GptOssForCausalLM is already registered, and will be overwritten by the new model class vllm_kunlun.models.gpt_oss:GptOssForCausalLM.
WARNING 04-02 18:40:32 [registry.py:814] Model architecture InternLM2ForCausalLM is already registered, and will be overwritten by the new model class vllm_kunlun.models.internlm2:InternLM2ForCausalLM.
WARNING 04-02 18:40:32 [registry.py:814] Model architecture InternVLChatModel is already registered, and will be overwritten by the new model class vllm_kunlun.models.internvl:InternVLChatModel.
WARNING 04-02 18:40:32 [registry.py:814] Model architecture InternS1ForConditionalGeneration is already registered, and will be overwritten by the new model class vllm_kunlun.models.interns1:InternS1ForConditionalGeneration.
WARNING 04-02 18:40:32 [registry.py:814] Model architecture SeedOssForCausalLM is already registered, and will be overwritten by the new model class vllm_kunlun.models.seed_oss:SeedOssForCausalLM.
WARNING 04-02 18:40:32 [registry.py:814] Model architecture MiMoV2FlashForCausalLM is already registered, and will be overwritten by the new model class vllm_kunlun.models.mimo_v2_flash:MiMoV2FlashForCausalLM.
WARNING 04-02 18:40:32 [registry.py:814] Model architecture GptOssForCausalLM is already registered, and will be overwritten by the new model class vllm_kunlun.models.gpt_oss:GptOssForCausalLM.
WARNING 04-02 18:40:32 [registry.py:814] Model architecture DeepseekV3ForCausalLM is already registered, and will be overwritten by the new model class vllm_kunlun.models.deepseek_v2:DeepseekV3ForCausalLM.
WARNING 04-02 18:40:32 [registry.py:814] Model architecture DeepseekV32ForCausalLM is already registered, and will be overwritten by the new model class vllm_kunlun.models.deepseek_v2:DeepseekV3ForCausalLM.
WARNING 04-02 18:40:32 [registry.py:814] Model architecture DeepSeekMTPModel is already registered, and will be overwritten by the new model class vllm_kunlun.models.deepseek_mtp:DeepSeekMTP.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f455905a290>, seed=123, num_prompts=320, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=10240, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url='http://127.0.0.1:8080', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=2, model='/data/Qwen3.5-122B-A10B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=True, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='95,99', goodput=None, request_id_prefix='bench-7a67c683-', top_p=None, top_k=None, min_p=None, temperature=0.7, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name='qwen3.5', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=30, extra_body=None)
INFO 04-02 18:40:33 [datasets.py:612] Sampling input_len from [10240, 10240] and output_len from [256, 256]
Starting initial single prompt test run...
Waiting for endpoint to become up in 30 seconds

 |          | 00:00 elapsed, ? remaining
 |          | 00:00 elapsed, 00:00 remaining
 |          | 00:05 elapsed, 67:50:22 remaining
Initial test run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 2

  0%|          | 0/320 [00:00<?, ?it/s]
  0%|          | 1/320 [00:07<38:03,  7.16s/it]
  1%|          | 3/320 [00:14<23:46,  4.50s/it]
  2%|▏         | 5/320 [00:21<21:05,  4.02s/it]
  2%|▏         | 7/320 [00:28<19:57,  3.82s/it]
  3%|▎         | 9/320 [00:35<19:19,  3.73s/it]
  3%|▎         | 11/320 [00:42<18:54,  3.67s/it]
  4%|▍         | 13/320 [00:49<18:35,  3.63s/it]
  5%|▍         | 15/320 [00:57<18:21,  3.61s/it]
  5%|▌         | 17/320 [01:04<18:10,  3.60s/it]
  6%|▌         | 19/320 [01:11<18:00,  3.59s/it]
  7%|▋         | 21/320 [01:18<17:50,  3.58s/it]
  7%|▋         | 23/320 [01:25<17:42,  3.58s/it]
  8%|▊         | 25/320 [01:32<17:35,  3.58s/it]
  8%|▊         | 27/320 [01:39<17:28,  3.58s/it]
  9%|▉         | 29/320 [01:47<17:19,  3.57s/it]
 10%|▉         | 31/320 [01:54<17:11,  3.57s/it]
 10%|█         | 33/320 [02:01<17:03,  3.57s/it]
 11%|█         | 35/320 [02:08<16:57,  3.57s/it]
 12%|█▏        | 37/320 [02:15<16:50,  3.57s/it]
 12%|█▏        | 39/320 [02:22<16:43,  3.57s/it]
 13%|█▎        | 41/320 [02:29<16:36,  3.57s/it]
 13%|█▎        | 43/320 [02:36<16:28,  3.57s/it]
 14%|█▍        | 45/320 [02:44<16:20,  3.57s/it]
 15%|█▍        | 47/320 [02:51<16:12,  3.56s/it]
 15%|█▌        | 49/320 [02:58<16:05,  3.56s/it]
 16%|█▌        | 51/320 [03:05<15:58,  3.56s/it]
 17%|█▋        | 53/320 [03:12<15:52,  3.57s/it]
 17%|█▋        | 55/320 [03:19<15:44,  3.56s/it]
 18%|█▊        | 57/320 [03:26<15:37,  3.56s/it]
 18%|█▊        | 59/320 [03:33<15:30,  3.56s/it]
 19%|█▉        | 61/320 [03:41<15:23,  3.56s/it]
 20%|█▉        | 63/320 [03:48<15:15,  3.56s/it]
 20%|██        | 65/320 [03:55<15:08,  3.56s/it]
 21%|██        | 67/320 [04:02<15:01,  3.56s/it]
 22%|██▏       | 69/320 [04:09<14:54,  3.56s/it]
 22%|██▏       | 71/320 [04:16<14:48,  3.57s/it]
 23%|██▎       | 73/320 [04:23<14:42,  3.57s/it]
 23%|██▎       | 75/320 [04:31<14:34,  3.57s/it]
 24%|██▍       | 77/320 [04:38<14:27,  3.57s/it]
 25%|██▍       | 79/320 [04:45<14:21,  3.57s/it]
 25%|██▌       | 81/320 [04:52<14:15,  3.58s/it]
 26%|██▌       | 83/320 [04:59<14:07,  3.58s/it]
 27%|██▋       | 85/320 [05:06<14:00,  3.58s/it]
 27%|██▋       | 87/320 [05:13<13:52,  3.57s/it]
 28%|██▊       | 89/320 [05:21<13:44,  3.57s/it]
 28%|██▊       | 91/320 [05:28<13:37,  3.57s/it]
 29%|██▉       | 93/320 [05:35<13:30,  3.57s/it]
 30%|██▉       | 95/320 [05:42<13:23,  3.57s/it]
 30%|███       | 97/320 [05:49<13:15,  3.57s/it]
 31%|███       | 99/320 [05:56<13:08,  3.57s/it]
 32%|███▏      | 101/320 [06:03<13:01,  3.57s/it]
 32%|███▏      | 103/320 [06:11<12:55,  3.57s/it]
 33%|███▎      | 105/320 [06:18<12:47,  3.57s/it]
 33%|███▎      | 107/320 [06:25<12:39,  3.57s/it]
 34%|███▍      | 109/320 [06:32<12:31,  3.56s/it]
 35%|███▍      | 111/320 [06:39<12:24,  3.56s/it]
 35%|███▌      | 113/320 [06:46<12:17,  3.56s/it]
 36%|███▌      | 115/320 [06:53<12:10,  3.57s/it]
 37%|███▋      | 117/320 [07:00<12:03,  3.56s/it]
 37%|███▋      | 119/320 [07:08<11:55,  3.56s/it]
 38%|███▊      | 121/320 [07:15<11:48,  3.56s/it]
 38%|███▊      | 123/320 [07:22<11:40,  3.56s/it]
 39%|███▉      | 125/320 [07:29<11:33,  3.55s/it]
 40%|███▉      | 127/320 [07:36<11:26,  3.56s/it]
 40%|████      | 129/320 [07:43<11:19,  3.56s/it]
 41%|████      | 131/320 [07:50<11:12,  3.56s/it]
 42%|████▏     | 133/320 [07:57<11:06,  3.56s/it]
 42%|████▏     | 135/320 [08:05<10:59,  3.56s/it]
 43%|████▎     | 137/320 [08:12<10:51,  3.56s/it]
 43%|████▎     | 139/320 [08:19<10:44,  3.56s/it]
 44%|████▍     | 141/320 [08:26<10:38,  3.57s/it]
 45%|████▍     | 143/320 [08:33<10:31,  3.57s/it]
 45%|████▌     | 145/320 [08:40<10:23,  3.57s/it]
 46%|████▌     | 147/320 [08:47<10:16,  3.56s/it]
 47%|████▋     | 149/320 [08:54<10:09,  3.56s/it]
 47%|████▋     | 151/320 [09:02<10:02,  3.56s/it]
 48%|████▊     | 153/320 [09:09<09:55,  3.56s/it]
 48%|████▊     | 155/320 [09:16<09:47,  3.56s/it]
 49%|████▉     | 157/320 [09:23<09:40,  3.56s/it]
 50%|████▉     | 159/320 [09:30<09:32,  3.56s/it]
 50%|█████     | 161/320 [09:37<09:25,  3.56s/it]
 51%|█████     | 163/320 [09:44<09:18,  3.56s/it]
 52%|█████▏    | 165/320 [09:51<09:11,  3.56s/it]
 52%|█████▏    | 167/320 [09:58<09:04,  3.56s/it]
 53%|█████▎    | 169/320 [10:06<08:57,  3.56s/it]
 53%|█████▎    | 171/320 [10:13<08:50,  3.56s/it]
 54%|█████▍    | 173/320 [10:20<08:43,  3.56s/it]
 55%|█████▍    | 175/320 [10:27<08:36,  3.56s/it]
 55%|█████▌    | 177/320 [10:34<08:29,  3.56s/it]
 56%|█████▌    | 179/320 [10:41<08:22,  3.56s/it]
 57%|█████▋    | 181/320 [10:48<08:14,  3.56s/it]
 57%|█████▋    | 183/320 [10:55<08:08,  3.56s/it]
 58%|█████▊    | 185/320 [11:03<08:00,  3.56s/it]
 58%|█████▊    | 187/320 [11:10<07:53,  3.56s/it]
 59%|█████▉    | 189/320 [11:17<07:46,  3.56s/it]
 60%|█████▉    | 191/320 [11:24<07:39,  3.56s/it]
 60%|██████    | 193/320 [11:31<07:31,  3.56s/it]
 61%|██████    | 195/320 [11:38<07:24,  3.56s/it]
 62%|██████▏   | 197/320 [11:45<07:17,  3.56s/it]
 62%|██████▏   | 199/320 [11:52<07:11,  3.56s/it]
 63%|██████▎   | 201/320 [12:00<07:03,  3.56s/it]
 63%|██████▎   | 203/320 [12:07<06:56,  3.56s/it]
 64%|██████▍   | 205/320 [12:14<06:49,  3.56s/it]
 65%|██████▍   | 207/320 [12:21<06:43,  3.57s/it]
 65%|██████▌   | 209/320 [12:28<06:36,  3.58s/it]
 66%|██████▌   | 211/320 [12:35<06:29,  3.57s/it]
 67%|██████▋   | 213/320 [12:42<06:21,  3.57s/it]
 67%|██████▋   | 215/320 [12:50<06:14,  3.57s/it]
 68%|██████▊   | 217/320 [12:57<06:07,  3.56s/it]
 68%|██████▊   | 219/320 [13:04<06:00,  3.56s/it]
 69%|██████▉   | 221/320 [13:11<05:52,  3.56s/it]
 70%|██████▉   | 223/320 [13:18<05:45,  3.56s/it]
 70%|███████   | 225/320 [13:25<05:38,  3.57s/it]
 71%|███████   | 227/320 [13:32<05:31,  3.56s/it]
 72%|███████▏  | 229/320 [13:39<05:23,  3.56s/it]
 72%|███████▏  | 231/320 [13:46<05:16,  3.56s/it]
 73%|███████▎  | 233/320 [13:54<05:09,  3.56s/it]
 73%|███████▎  | 235/320 [14:01<05:02,  3.56s/it]
 74%|███████▍  | 237/320 [14:08<04:55,  3.56s/it]
 75%|███████▍  | 239/320 [14:15<04:48,  3.56s/it]
 75%|███████▌  | 241/320 [14:22<04:41,  3.56s/it]
 76%|███████▌  | 243/320 [14:29<04:34,  3.56s/it]
 77%|███████▋  | 245/320 [14:36<04:26,  3.56s/it]
 77%|███████▋  | 247/320 [14:43<04:19,  3.56s/it]
 78%|███████▊  | 249/320 [14:51<04:12,  3.56s/it]
 78%|███████▊  | 251/320 [14:58<04:05,  3.56s/it]
 79%|███████▉  | 253/320 [15:05<03:58,  3.56s/it]
 80%|███████▉  | 255/320 [15:12<03:51,  3.56s/it]
 80%|████████  | 257/320 [15:19<03:44,  3.57s/it]
 81%|████████  | 259/320 [15:26<03:37,  3.57s/it]
 82%|████████▏ | 261/320 [15:33<03:30,  3.57s/it]
 82%|████████▏ | 263/320 [15:40<03:23,  3.56s/it]
 83%|████████▎ | 265/320 [15:48<03:15,  3.56s/it]
 83%|████████▎ | 267/320 [15:55<03:08,  3.56s/it]
 84%|████████▍ | 269/320 [16:02<03:01,  3.56s/it]
 85%|████████▍ | 271/320 [16:09<02:54,  3.56s/it]
 85%|████████▌ | 273/320 [16:16<02:47,  3.56s/it]
 86%|████████▌ | 275/320 [16:23<02:40,  3.56s/it]
 87%|████████▋ | 277/320 [16:30<02:32,  3.56s/it]
 87%|████████▋ | 279/320 [16:37<02:25,  3.55s/it]
 88%|████████▊ | 281/320 [16:44<02:18,  3.55s/it]
 88%|████████▊ | 283/320 [16:52<02:11,  3.55s/it]
 89%|████████▉ | 285/320 [16:59<02:04,  3.56s/it]
 90%|████████▉ | 287/320 [17:06<01:57,  3.56s/it]
 90%|█████████ | 289/320 [17:13<01:50,  3.56s/it]
 91%|█████████ | 291/320 [17:20<01:43,  3.56s/it]
 92%|█████████▏| 293/320 [17:27<01:36,  3.56s/it]
 92%|█████████▏| 295/320 [17:34<01:29,  3.56s/it]
 93%|█████████▎| 297/320 [17:41<01:21,  3.56s/it]
 93%|█████████▎| 299/320 [17:49<01:14,  3.56s/it]
 94%|█████████▍| 301/320 [17:56<01:07,  3.56s/it]
 95%|█████████▍| 303/320 [18:03<01:00,  3.56s/it]
 95%|█████████▌| 305/320 [18:10<00:53,  3.56s/it]
 96%|█████████▌| 307/320 [18:17<00:46,  3.56s/it]
 97%|█████████▋| 309/320 [18:24<00:39,  3.56s/it]
 97%|█████████▋| 311/320 [18:31<00:32,  3.56s/it]
 98%|█████████▊| 313/320 [18:38<00:24,  3.56s/it]
 98%|█████████▊| 315/320 [18:46<00:17,  3.56s/it]
 99%|█████████▉| 317/320 [18:53<00:10,  3.56s/it]
100%|█████████▉| 319/320 [19:00<00:03,  3.56s/it]
100%|██████████| 320/320 [19:00<00:00,  3.56s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     320       
Failed requests:                         0         
Maximum request concurrency:             2         
Benchmark duration (s):                  1140.31   
Total input tokens:                      3276800   
Total generated tokens:                  81920     
Request throughput (req/s):              0.28      
Output token throughput (tok/s):         71.84     
Peak output token throughput (tok/s):    94.00     
Peak concurrent requests:                4.00      
Total token throughput (tok/s):          2945.46   
---------------Time to First Token----------------
Mean TTFT (ms):                          1208.17   
Median TTFT (ms):                        1217.85   
P95 TTFT (ms):                           1591.88   
P99 TTFT (ms):                           1610.00   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          23.21     
Median TPOT (ms):                        23.28     
P95 TPOT (ms):                           24.71     
P99 TPOT (ms):                           24.83     
---------------Inter-token Latency----------------
Mean ITL (ms):                           23.12     
Median ITL (ms):                         21.74     
P95 ITL (ms):                            22.11     
P99 ITL (ms):                            22.97     
==================================================